In [15]:
import pandas as pd
import numpy as np
import sqlite3

In [16]:
conn = sqlite3.connect(r"mltwentymil.db")

In [17]:
genomescores = pd.read_csv("ml-20m/genome-scores.csv")
genomescores.head()

   movieId  tagId  relevance
0        1      1    0.02500
1        1      2    0.02500
2        1      3    0.05775
3        1      4    0.09675
4        1      5    0.14675

In [18]:
genomescores.to_sql("genomescores", conn, if_exists="replace")

In [19]:
genometags = pd.read_csv("ml-20m/genome-tags.csv")
genometags.head()

   tagId           tag
0      1           007
1      2  007 (series)
2      3  18th century
3      4         1920s
4      5         1930s

In [20]:
genometags.to_sql("genometags", conn, if_exists="replace")

In [21]:
links = pd.read_csv("ml-20m/links.csv")
links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [22]:
links.to_sql("links", conn, if_exists="replace")

In [23]:
movies = pd.read_csv("ml-20m/movies.csv")
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [24]:
movies.to_sql("movies", conn, if_exists="replace")

In [25]:
ratings = pd.read_csv("ml-20m/ratings.csv")
ratings.head()

   userId  movieId  rating   timestamp
0       1        2     3.5  1112486027
1       1       29     3.5  1112484676
2       1       32     3.5  1112484819
3       1       47     3.5  1112484727
4       1       50     3.5  1112484580

In [26]:
ratings.to_sql("ratings", conn, if_exists="replace")

In [27]:
tags = pd.read_csv("ml-20m/tags.csv")
tags.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

In [28]:
tags.to_sql("tags", conn, if_exists="replace")